Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyBuildingOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyBuildingOperation_t@)
DO NOT USE! For internal usage only!
Building:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportBuildingHierarchyGetObjectsOperation(Tekla.Structures.ModelInternal.dotBuildingHierarchyGetObjectsOperation_t@)
DO NOT USE! For internal usage only!
OverrideOperation:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportRunClashCheckWithOptions(System.Int32,System.Int32,System.Double,System.Int32)
DO NOT USE! For internal usage only!
betweenReferenceModels:
objectsInsideReferenceModels:
minDistance:
betweenParts:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.GetReferenceModelObjectFaces(Tekla.Structures.Internal.dotIdentifier_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
pReferenceObjectIdentifier: The reference object identifier.
pClientId: Client id.
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportModel(System.String,System.String,System.String,System.String,System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
DO NOT USE! For internal usage only!
aOutPath:
aBasePointGuid:
aBasePointExportType:
aExportType:
aPropertiesPath:
selectedOnly:
assemblies:
allAssemblyParts:
parts:
rebars:
bolts:
welds:
surfaces:
surfaceTreatments:
grids:
spatialHierarchy:
pours:
Returns:

Tekla.Structures.ModelInternal.CDelegateWrapper.ExportGetShapeMetadata(System.String,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
clientID: ClientId for this session
guid: Shape GUID///
Returns: Returns 1 if the operation was fully successful, otherwise 0.